[{"slot":22001,"id":31003,"name":"Comment j\u0027ai mis ma suite de tests au régime en 5 minutes par jour","description":"Ecrire des tests, toujours plus de tests, une étape nécessaire à tout logiciel de qualité. Seulement, plus il y a de tests, plus le build est long. Plus le build est long, plus il faut de temps pour corriger un bug, plus il faut de temps pour déployer des nouvelles fonctionnalités. Pour être efficace, un build complet devrait durer moins de cinq minutes. C\u0027est le cas de votre build. Non ? Si tel n\u0027est pas le cas, comment réduire la durée des tests ? Par où commencer ? Plusieurs stratégies sont efficaces: rendre certains tests inutiles, convertir des tests fonctionnels en tests unitaires, exécuter les tests en parallèle, mettre en commun les lourdes initialisations... De nombreux outils peuvent vous aider en chemin. Partageons des dizaines de conseils pour accélérer vos tests de façon TRES significative. Attention ! Cette présentations est destinée aussi bien aux fainéants et aux tricheurs, qu\u0027aux courageux. Trois approches à explorer seules ou à combiner. ","room":"","track":3001,"speakers":[35002],"tags":[]},{"slot":26001,"id":32002,"name":"Intelligence collective avec Apache Mahout","description":"Notre expérience quotidienne sur Internet est actuellement facilitée par de nombreux mécanismes intelligents comme par exemple lorsqu\u0027Amazon nous suggère un article similaire, lorsque LinkedIn nous présente des personnes que nous connaissons probablement, ou encore lorsque Google News regroupe automatiquement les articles traitant d\u0027un même sujet. Ces fonctionnalités hier encore réservées à des experts en machine learning sont aujourd\u0027hui rendues plus abordables par le framework Apache Mahout qui permet d\u0027analyser une grande quantité de données pour en extraire des suggestions, des classifications ou encore des regroupements intelligents.","room":"","track":3001,"speakers":[12001],"tags":[]},{"slot":22001,"id":33002,"name":"HTML5 .. la révolution maintenant!","description":"Après des années de disette en terme d\u0027innovation, HTML v5 est enfin arrivé ... Nous verrons à travers les nouveautés proposées en quoi cela va transformer les usages du web \u0026 mobile. Nous ferons le point sur son adoption \u0026 un retour sur une implémentation concrète dans un projet client.","room":"","track":19001,"speakers":[33001,32001],"tags":[50002]},{"slot":22001,"id":33003,"name":"BDD (Behavior Driven Development) - Une voie vers l\u0027agilité","description":"Nous présenterons BDD comme un paradigme de développement et nous discuterons de la façon dont il s\u0027intègre dans les approches Agiles, comme Scrum ou XP. Nous présenterons JBehave comme un outil Java supportant les principes BDD. Nous présenterons également une rétrospective de l\u0027utilisation de BDD et de JBehave dans un projet commercial d\u0027envergure, et illustrerons comment notamment ils ont encouragé l\u0027agilité.","room":"","track":18001,"speakers":[31001],"tags":[53001]},{"slot":24001,"id":33004,"name":"Introduction à Clojure","description":"Vous cherchez à produire plus tout en codant mieux, être plus réactif, dans un écosystème Java ? \u003cbr/\u003eVenez découvrir le langage Clojure : simple, fiable, performant et ultra-expressif ! \u003cbr/\u003eLe truc ? Facile : sortez de votre zone de confort et pensez \u003ci\u003esimple\u003c/i\u003e, le jeu en vaut la chandelle !","room":"","track":3001,"speakers":[10001,11001],"tags":[]},{"slot":9001,"id":39003,"name":"Le mouvement devops","description":"Depuis l\u0027apparition du mot devops à l\u0027occasion des devopsdays de Gand en 2009, celui-ci s\u0027est propagé comme une trainée de poudre partout dans le monde, au point de devenir un véritable « Buzzword » parfois mal compris. La présentation retracera les origines du mouvement, sa relation à l\u0027agilité, et détaillera les idées du mouvement devops et ce qu\u0027il peut apporter.","room":"","track":18001,"speakers":[40007],"tags":[]},{"slot":9001,"id":40001,"name":"Pimp my app","description":"Nous sommes développeurs Java, nous avons tous des applications chez nos clients avec une base et surtout... de la complexité. Un peu de Spring, un peu d\u0027Hibernate, et beaucoup de complexité.  Comment peut-on virer tout ce qui ne sert à rien et se concentrer sur le métier avec un bon framework bien productif ?  Venez avec votre vieille application toute pourrie et repartez avec une pure application web, avec CSS3, HTML5 et surtout, de la fierté.","room":"","track":3001,"speakers":[36002],"tags":[]},{"slot":26001,"id":40002,"name":"Du cerveau au code : \"Agile\" ou le README manquant","description":"Qu\u0027est-ce que du \"bon\" ou du \"mauvais\" code? Qu\u0027est-ce qu\u0027une \"bonne\" ou une \"mauvaise\" conception? Un \"bon\" ou un \"mauvais\" concepteur? Doit-il obligatoirement utiliser UML, ou en tout cas une notation visuelle? Une phase de conception est-elle indispensable? Que faut-il attendre des outils d\u0027analyse automatique de la conception?  A toutes ces questions nous peinons à donner des réponses argumentées sur des bases concrètes, et nous enlisons dans des débats souvent stériles entre \"c\u0027est Agile\" et \"ce n\u0027est pas Agile\". Cette session vise à vous proposer un autre angle de vision sur la conception du code, qui vous apportera un regard différent sur les pratiques de conception que vous connaissez déjà et pourra vous inspirer des pistes prometteuses pour continuer à vous améliorer. Elle vous entraînera dans des recoins insoupçonnés de votre propre cerveau, équipement crucial à toute activité de programmation et pourtant si méconnu, si peu exploré dans notre discipline du \"génie logiciel\".","room":"","track":18001,"speakers":[37001],"tags":[]},{"slot":26001,"id":40006,"name":"Alchimiste-Agile.com : l\u0027Art de la Rétrospective","description":"Qui n’a jamais rêvé de transformer “ses plombs” en or ?!... De voyager avec un trésor de savoir au lieu de traîner les boulets de projets passés ? Eh bien la Pierre Philosophale existe ! Seulement, toutes ces années elle était précieusement dissimulée sous le nom de code de Rétrospective. Nous vous proposons de vous initier à ce rite en partageant ses secrets, ses règles, ses principes, et quelques pratiques clefs.  Envie de goûter à l’élixir de l’amélioration perpétuelle? Apprentis Alchimistes ou spectateurs intrigués, venez explorer notre Laboratoire ! Aucune connaissance technique ou (al)chimique nécessaire... Tout signe zodiacal admis !","room":"","track":20001,"speakers":[47001,44002],"tags":[48002,53001]},{"slot":24001,"id":41001,"name":"Agile Sans Frontières","description":"Le changement Agile commence souvent avec un fort accent sur les processus et pratiques de développement. Une fois que cet élément de la chaîne de valeur du produit global pour le développement est devenu optimisé, le goulot d’étranglement dans le système se déplace ailleurs. Habituellement, il se déplace au niveau de la direction des produits, avec comme challenge de fournir les conditions et le soutien pour garder une équipe agile se déplaçant à une vitesse supérieure.  Afin de soutenir un changement plus important dans une organisation vers la méthodologie Agile, il est essentiel de se focaliser également sur les éléments préliminaires au développement, souvent appelée la «phase de découverte.\" Grâce à une combinaison d’organisation planifiée, de la découverte des besoins du produit et de cartographier les cas d’utilisation. La livraison par les équipes sera organisée pour travailler conformément au fonctionnalités attendues clairement définies et priorisées afin de parvenir à une valeur ajoutée maximale.   Dans cette session, je parlerai des combats concernant l’Agile en R \u0026 D qui est souvent confronté aux limites de livraison et de découverte des besoins, et comment mettre en place une approche qui étend à une échelle globale la valeur de l’Agile plus en profondeur dans l\u0027organisation. Je vais aussi parler d\u0027une combinaison d\u0027approches et de techniques que j\u0027utilise en tant que coach et qui m\u0027aident à être efficace pour diriger les changements de l’Agile dans des environnements complexes, distribués et internationales.","room":"","track":5001,"speakers":[38001],"tags":[]},{"slot":22001,"id":44001,"name":"Lean et agile : gérer la dette technique pour mieux s\u0027aligner avec le business","description":"Plus que jamais, les clients demandent de la réactivité, de l’agilité. Comment faire pour que les équipes puissent répondre aux attentes ? Le management de la dette technique est un des éléments de réponse. Au travers d’un retour d’expérience, vous apprendrez comment VOIR la dette technique, COMPRENDRE ce qu’il est possible de faire, AGIR pour faire progresser la situation... Enfin cela sera l’opportunité de s’interroger sur notre conception du logiciel et des systèmes d’informations, plutôt que chercher à ajouter des fonctionnalités, ne doit-on pas finalement chercher à en retirer en permanence ?  A retenir de cette présentation  EASIER, BETTER, FASTER, CHEAPER...","room":"","track":5001,"speakers":[43001],"tags":[53001]},{"slot":26001,"id":45001,"name":"Fable du Product Owner et de la Maîtrise d’Ouvrage (MOA)","description":"Il était une fois … une Maîtrise d’Ouvrage qui réussit à devenir Product Owner sur un projet réalisé en mode Scrum.  La session couvrira à la fois les pratiques agiles du Product Owner (Valeur Métier, Product Backlog, Release Plan …) mais également les changements de comportement vis-à-vis des utilisateurs et de l’équipe de réalisation. Un focus particulier sera porté sur les métriques agiles présentées par le Product Owner en Comité de Direction, sur l\u0027utilisation d\u0027une roadmap agile et sur le déroulement de la recette.","room":"","track":5001,"speakers":[39001],"tags":[]},{"slot":9001,"id":46001,"name":"Stewardship : soluble dans mon entreprise ?","description":"L\u0027auto-organisation fait partie des principes agiles. Plus facile à dire qu\u0027à faire ! Nous allons donc examiner ce qu\u0027est le stewardship, les freins et quelques pistes pour sa mise en œuvre, en particulier « Scrum » et stewardship.","room":"","track":5001,"speakers":[40005],"tags":[]},{"slot":26001,"id":49001,"name":"NoSQL : Enfin de la biodiversité dans l’écosystème des bases de données","description":"NoSQL est en passe de réussir là où les bases de données objet et XML ont échoué : offrir de nouveaux systèmes de stockage alternatif à notre “bonne vieille” base de données relationnelle, pour répondre au mieux aux problématiques actuelles.  Nous vous aiderons à vous y retrouver dans la jungle des technologies NoSQL, à comprendre les différents types de solutions utilisées par les grands acteurs du Web. Sans pourtant reléguer au placard les SGBDs classiques, vous découvrirez les cas d’utilisations typiques de ces technologies et comment les bases NoSQL permettent d’apporter des solutions simples et élégantes à des problèmes trop complexes en relationnel, tout en répondant aux problématiques de scalabilité.","room":"","track":3001,"speakers":[48001],"tags":[52001]},{"id":54002,"name":"Smartphone : et l\u0027informatique devint mobile...","description":"Avec l’iPhone d’Apple est apparu sur le marché un terminal informatique miniature dont les facultés dépassent largement celles d’un PC traditionnel.  La fonction téléphone n’étant qu’un de ses talents. Le Smartphone d’aujourd’hui réunit dans un petit galet de plastique et de verre : une caméra, un appareil photo, un enregistreur audio, un gyroscope, un terminal GPS… C’est aussi le plus communiquant de tous les appareils, il met Internet dans votre poche ! Il est particulièrement intuitif grâce à son ergonomie raffinée utilisant l’outil le plus naturel pour l’homme : le doigt. Ses usages personnels sont évidents : de l’agenda à la navigation automobile, on ne compte plus les outils qu’il remplace. Mais a-t-il une place dans l’informatique d’entreprise ?    Cette place on la cherche, on la pressent, sans toujours la trouver. A l’évidence sa petite taille ne lui permet pas de supplanter les postes de travail classiques et c’est dans de nouveaux usages, de nouveaux types d’applications, que son utilité va prendre sens. Prendre une photo sur un lieu d’intervention et la transmettre de suite,  faire un compte-rendu oral, interroger son application depuis n’importe quel lieu ouvre des perspectives inédites. Le Smartphone a donc bien sa place dans nos Systèmes d’Information. Il est très probable qu’à l’instar de l’ordinateur personnel ou d’Internet, il changera notre façon de travailler.","room":"","track":19001,"speakers":[57001],"tags":[]},{"id":55001,"name":"Test du futur avec Spock","description":"Spock est un framework de test utilisant le langage Groovy d\u0027une manière très avancée, pour permettre l\u0027écriture de vos tests de manière très élégante, claire et concise. C\u0027est une librairie qui a beaucoup de succès dans l\u0027écosystème Groovy.  Vous découvrirez également la facilité d\u0027utilisation de Groovy pour tester du code Java et ses principaux apports par rapport aux autres frameworks de tests.","room":"","track":18001,"speakers":[54001],"tags":[]},{"id":58001,"name":"Building complex and modular RIAs with OSGi and Flex","description":"Au cours de sa conférence, François expliquera comment concevoir une application hautement modulaire avec OSGi et Flex et comment architecturer une telle application de manière à ce que les évolutions futures n\u0027entraînent pas une interruption totale de service. Pour cela, il présentera les différents moyens de communication entre le client Flex et le backend OSGi. A cette occasion, il établira une comparaison rapide entre les différentes briques logicielles open source permettant d’intégrer ces deux technologies. Puis, il montrera comment une application Flex peut être découpée en un ensemble de sous applications qui pourront être chargées ou déchargées à chaud grâce aux mécanismes de déploiement offerts par OSGi.","room":"","track":19001,"speakers":[56002],"tags":[]}]