[{"id":10001,"lastName":"Grand","firstName":"Christophe","bio":"Christophe Grand est consultant indépendant. Il est membre de la communauté Clojure de longue date, et un des contributeurs au langage. Il est également l’auteur de 2 librairies Clojure réputées, “Enlive” et “Moustache”. Il tient blog contenant des informations ‘pointues’ sur Clojure. Christophe est intervenu en tant que speaker à la première conférence Clojure en octobre 2010, et travaille actuellement sur un livre Clojure pour les éditions O\u0027Reilly.","company":"","urlImage":"http://agnes007.lautre.net/perso/grand.png","twitter":"http://twitter.com/cgrand","linkedin":"","blog":"http://clj-me.cgrand.net/","sessions":[33004]},{"id":11001,"lastName":"Petit","firstName":"Laurent","bio":"Laurent Petit est le développeur/sponsor principal du projet “Counterclockwise”, une extension de l’IDE Eclipse pour écrire des applications avec Clojure. Il a été séduit très  tôt par Clojure et s’investit depuis dans sa communauté. Il est intervenu en tant que speaker à la première conférence Clojure en octobre 2010. Il a travaillé 8 ans en société de service, avant de rejoindre en 2008 la société Yseop, éditeur spécialisé dans l’industrialisation des activités de conseil pour la Relation Client.","company":"","urlImage":"http://agnes007.lautre.net/perso/petit.png","twitter":"http://twitter.com/petitlaurent","linkedin":"","blog":"http://code.google.com/p/counterclockwise/","sessions":[33004]},{"id":12001,"lastName":"Figuière","firstName":"Michaël","bio":"Michaël est consultant chez Xebia où il intervient notamment sur des sites Web à fort trafic. A son aise tant avec les environnements Java d\u0027entreprise qu\u0027avec les technologies de plus bas niveau, il est spécialisé dans les architectures distribuées et les technologies innovantes telles que NoSQL, les moteurs de recherche, ou encore le data mining. Il intervient régulièrement dans des Java User Group pour parler de ses sujets favoris et est l\u0027auteur de nombreux articles.","company":"","urlImage":"http://www.parisjug.org/xwiki/bin/download/Speaker/MichaelFiguiere/michaelFiguiere.jpg","twitter":"http://twitter.com/mfiguiere","linkedin":"http://linkedin.com/in/mfiguiere","blog":"http://blog.xebia.fr/","sessions":[32002]},{"id":31001,"lastName":"Talevi","firstName":"Mauro","bio":"Mauro Talevi travaille pour la société Agilesque spécialisée dans le conseil, le coaching et les développements Agile. Il a accompagné les entreprises dans la réalisation de gros projets en introduisant les pratiques et les outils Agiles, convaincu que les meilleurs résultats peuvent être obtenus en réunissant les bonnes idées et les outils appropriés pour les implémenter.","company":"","urlImage":"http://skillsmatter.com/custom/geeks/mt.jpg","twitter":"","linkedin":"http://uk.linkedin.com/in/maurotalevi","blog":"","sessions":[33003]},{"id":32001,"lastName":"Duval","firstName":"Alain","bio":"Présent chez Objectif depuis sa création en 1997, Alain Duval en est maintenant le Directeur Technique. Opérationnel en conseil \u0026 expertise JAVA EE, il se partage entre le développement des offres (Android, GWT2, Software Factory, Performance) auprès des clients \u0026 la capitalisation des connaissances.","company":"","urlImage":"http://agnes007.lautre.net/perso/alain.jpg","twitter":"http://twitter.com/aduval93","linkedin":"http://fr.linkedin.com/pub/alain-duval/21/85b/41b","blog":"","sessions":[33002]},{"id":33001,"lastName":"Beurtheret","firstName":"Cédric","bio":"Tombé dans la marmite IT depuis tout petit, Cédric Beurtheret est expert JAVA EE chez Objectif Il consacre son temps entre des missions opérationnelles chez les clients (architecture/support) \u0026 des travaux de R\u0026D en relation avec la direction technique.Il vient de terminer un projet pour un client bancaire mélant GWT 2 \u0026 HTML5.","company":"","urlImage":"http://agnes007.lautre.net/perso/cedric.jpg","twitter":"http://twitter.com/cbe317","linkedin":"http://fr.linkedin.com/pub/cedric-beurtheret/22/44/b05","blog":"","sessions":[33002]},{"id":35002,"lastName":"Gageot","firstName":"David","bio":"David Gageot est directeur technique chez Algodeal, un fond d\u0027investissement quantitatif. Après 4 années chez Valtech Technology, à aider ses clients à comprendre, initialiser et adopter Scrum sur le long terme, David revient à ses premières amours, l\u0027écriture de logiciel pointu, le travail d\u0027équipe et la mise en pratique de l\u0027amélioration continue. David participe à des projets Java depuis 1998, comme responsable des développements chez l\u0027éditeur Adesoft puis comme expert Java et Scrum Master certifié chez Valtech. Il a pour leitmotiv d\u0027être un facilitateur qui, par sa créativité et son expertise, aide les équipes à être plus innovantes et plus efficaces.","company":"","urlImage":"http://www.parisjug.org/xwiki/bin/download/Speaker/DavidGageot/davidGageot-h114.jpg","twitter":"http://twitter.com/#!/dgageot","linkedin":"http://fr.linkedin.com/in/davidgageot","blog":"http://javabien.net","sessions":[31003]},{"id":36002,"lastName":"Martignole","firstName":"Nicolas","bio":"Nicolas est indépendant depuis 2008, auteur du blog le Touilleur Express et membre de l\u0027équipe du Paris JUG depuis 2 ans.  Il travaille plutôt dans la Finance, en tant que technical team leader. Un peu d\u0027Agilité, pas mal de développements et de bonnes pratiques et surtout, du fun. En quelques mots, son parcours : 5 ans dans une agence Web puis une Startup Java 6 ans chez Thomson-Reuters dans la Finance, développeur senior puis technical team leader, depuis 2008 consultant indépendant. ","company":"","urlImage":"http://agnes007.lautre.net/perso/nicolas_martignole_big.jpg","twitter":"http://twitter.com/#!/nmartignole","linkedin":"http://fr.linkedin.com/in/nmartignole","blog":"http://www.touilleur-express.fr/","sessions":[40001]},{"id":37001,"lastName":"Bossavit","firstName":"Laurent","bio":"Laurent Bossavit est directeur de l’Institut Agile, organisation indépendante qui a pour mission de promouvoir la recherche sur les pratiques agiles et de faciliter leur adoption dans les entreprises.","company":"","urlImage":"http://agnes007.lautre.net/perso/Laurent_Bossavit.jpg","twitter":"http://twitter.com/morendil","linkedin":"","blog":"","sessions":[40002]},{"id":38001,"lastName":"Adams","firstName":"Mack","bio":"Coach Agile chez Axway, dirige leur transformation globale depuis 2009. Consultant chez ThoughtWorks pendant 5+ ans axé sur l’exécution des projets et du changement agile Orienté sur la méthodologie Agile et product management, user story mapping, mise a l’échelle globale d’une méthodologie, program/projet gouvernance, Agile chartering. Il a vécu en cinq pays : Canada, Etas-Unis, Inde, Royaume-Uni, et France","company":"","urlImage":"http://agnes007.lautre.net/perso/MackAdams_Profile.jpg","twitter":"http://twitter.com/mackaraja","linkedin":"","blog":"http://www.false-deadlines.com","sessions":[41001]},{"id":39001,"lastName":"Boutin","firstName":"Alexandre","bio":"Diplômé de l’Ensimag en 1989, Alexandre découvre l’Agilité en 2004 et prend en charge la promotion de l’Agilité en Europe, Asie et Inde pour Yahoo International de 2005 à 2009. \u003cbr/\u003eDébut 2009, Alexandre décide de créer la société AGILETOYOU pour former et accompagner de nombreux clients désireux de devenir Agile (Orange, EDF, Total, Samse, BBC, BULL … et plusieurs PME). \u003cbr/\u003eAlexandre est également un orateur régulier des conférences nationales et préside le CARA (Club Agile Rhône Alpes) qui organise la conférence AGILE GRENOBLE qui réunit 450 professionnels sur 1 journée","company":"","urlImage":"http://agnes007.lautre.net/perso/Alexandre_Boutin.jpg","twitter":"http://twitter.com/agilex","linkedin":"http://fr.linkedin.com/in/boutin","blog":"http://www.agilex.fr/","sessions":[45001]},{"id":40005,"lastName":"Cros","firstName":"Thierry","bio":"Il est fondateur de Extreme Programming France en 2000. Depuis 10 ans, il pratique le coaching agile (Scrum + XP, Lean) et donne des formations.","company":"","urlImage":"http://etreagile.thierrycros.net/home/public/.agiletour_tcr_t.jpg","twitter":"http://twitter.com/thierrycros","linkedin":"http://fr.linkedin.com/in/thierrycros","blog":"http://etre-agile.com","sessions":[46001]},{"id":40007,"lastName":"Le Nadan","firstName":"Gildas","bio":"Gildas a travaillé en Europe dans différents secteurs (recherche, bancaire, télécom, web) en temps qu\u0027ingénieur système, architecte infrastructure ou responsable exploitation.  Intéressé par l\u0027agilité et son adaptation aux problématiques d\u0027exploitation, il a vu naître le mouvement devops auquel il participe depuis le tout début.  Gildas est désormais indépendant et apporte à ses clients son expertise technologique (web, opensource, haute performance), tout en jouant un rôle de facilitation entre le développement et l\u0027exploitation.","company":"","urlImage":"http://agnes007.lautre.net/perso/Gildas-Le_Nadan.jpg","twitter":"http://twitter.com/endemics","linkedin":"http://www.linkedin.com/in/gildaslenadan","blog":"http://blog.endemics.info","sessions":[39003]},{"id":43001,"lastName":"Heitz","firstName":"Hugo","bio":"Hugo est un chef de projet, gestionnaire de services et responsable du déploiement Lean Six Sigma spécialisé dans les projets et services IT. Il aide les équipes afin de mieux servir leurs clients, réduire les coûts en éliminant les gaspillages, avec une approche où les personnes progressent constamment via une résolution rigoureuse des problèmes.  Ses centres d\u0027intérêts principaux concernent la disponibilité de service et la qualité du développement logiciel. Il a passé les premières années de sa carrière à écrire ou intégrer du code et à gérer des projets dans des domaines tels que les services collectifs, les médias et les services financi","company":"","urlImage":"http://agnes007.lautre.net/perso/hugo_heitz.png.png","twitter":"","linkedin":"http://fr.linkedin.com/in/hugoheitz","blog":"","sessions":[44001]},{"id":44002,"lastName":"Couvreur","firstName":"Jacques","bio":"Praticien XP et Scrum Master certifié, Jacques est le co-fondateur de inagua.ch, spécialisée en coaching et formation agile et le développement iOS et Rails. Il est le créateur de iStoriz.com, co-créateur d’agile-alchemist.com, créateur et président de soft-shake.ch, président d’Agile-Swiss.ch, organisateur des XP Days CH et Agile Tour Genève, membre fondateur de la FédérationAgile.com. Son moteur : collaborer sur des sujets aux limites de sa zone de confort.","company":"","urlImage":"http://agnes007.lautre.net/perso/jacques.couvreur.jpg","twitter":"http://twitter.com/JacquesCouvreur","linkedin":"http://ch.linkedin.com/in/jacquescouvreur","blog":"","sessions":[40006]},{"id":47001,"lastName":"Bachmann","firstName":"François","bio":"François Bachmann, CSP/CSM, adore accompagner des entreprises (finance, start-up web, SSII, industrie, scientifiques) à atteindre leur potentiel en améliorant leur collaboration. Il forme avec Jacques Couvreur l\u0027équipe des Alchimistes Agiles (alchimiste-agile.com) afin de promouvoir la Rétrospective. Citation favorite: «Wisdom is often nearer when we stoop than when we soar.» (W.Wordsworth)","company":"","urlImage":"http://agnes007.lautre.net/perso/francois_Bachmann.jpg","twitter":"http://twitter.com/FrBachmann","linkedin":"http://ch.linkedin.com/in/francoisbachmann","blog":"","sessions":[40006]},{"id":48001,"lastName":"Mallassi","firstName":"Olivier","bio":"Olivier est architecte senior chez \u003ca href\u003d\"www.octo.com\"\u003eOCTO\u003c/a\u003e où il intervient dans une grande variété de projets en tant qu’architecte, expert ou encore auditeur, et ce principalement pour des clients banque/assurance.  Outre ces domaines d’expertises historiques tels que les technologies Java/JEE (dont il est membre actif), Olivier est passionné par les architectures des grands du web, hautement scalables, évènementielles ainsi que les technologies dites noSql.","company":"","urlImage":"http://s3.amazonaws.com/usi_production/users/speaker_photos/95/tiny/olivier-mallassi.jpg?1284558700","twitter":"http://twitter.com/omallassi","linkedin":"http://www.linkedin.com/pub/olivier-mallassi/1/46/21","blog":"http://blog.octo.com/en/author/oma/","sessions":[49001]},{"id":54001,"lastName":"Lemée","firstName":"Mathilde","bio":"Développeur Java, je me suis lancée en tant qu\u0027indépendant à 25 ans, après 2 ans  en SSII. Je suis une fondatrice du JUG Duchesse France. Bénévole depuis 2007, je crée en 2011 \u003ca href\u003d\"http://www.ensemble-donnons.fr\"\u003ewww.ensemble-donnons.fr\u003c/a\u003e , pour aider les petites et moyennes associations à récolter des dons en ligne tout en continuant en parallèle mes missions de consultantes.","company":"","urlImage":"http://agnes007.lautre.net/perso/mathilde.JPG","twitter":"http://twitter.com/mathildelemee","linkedin":"http://www.linkedin.com/in/mathildelemee","blog":"http://www.java-freelance.fr/","sessions":[55001]},{"id":56002,"lastName":"Fornaciari","firstName":"François","bio":"François Fornaciari est consultant et formateur Java EE / OSGi et RIA chez Zenika. Il est membre du board de l\u0027OSGi Users\u0027 Group France. Au sein de la cellule R\u0026D chez Bull, il a participé à la refonte du serveur d\u0027applications JOnAS entièrement basé sur une architecture OSGi. De plus, François a animé des conférences sur les thèmes de l\u0027OSGi et son intégration avec Java EE et Flex.","company":"","urlImage":"http://media01.linkedin.com/mpr/mpr/shrink_80_80/p/1/000/077/264/35e190f.jpg","twitter":"http://twitter.com/#!/fornacif","linkedin":"http://www.linkedin.com/in/fornacif","blog":"","sessions":[58001]},{"id":57001,"lastName":"Demoustier","firstName":"Christian","bio":"Directeur Technique et formateur chez Objet Direct où il exerce depuis sa création en 1998, Christian conseille les DSI dans leurs choix d\u0027architectures et de technologies et les accompagne pour une mise en œuvre réussit. Aujourd\u0027hui il évangélise ses clients pour les aider à ne pas rater le virage de la mobilité...","company":"","urlImage":"http://agnes007.lautre.net/perso/Christian_Demoustier_bis.jpg","twitter":"","linkedin":"","blog":"","sessions":[54002]}]